{
  "3d503d2b": "No items found.",
  "3a3d1e37": "shop this look",
  "41a27ce3": "FOOTJOY X TODD SNYDER THE FRENCH TERRY RAGLAN HOODIE IN NAVY",
  "6131982e": "How would golf’s most iconic players from the Sixties and Seventies dress if they stepped onto the links today? The answer is this new collection of polos, windbreakers, hoodies, cardigans, shorts, joggers, caps, and golf shoes. Here, the humble hoodie gets a clubhouse-worthy upgrade. Made from a performance stretch fabric, this sweatshirt looks as good as it plays. There is white piping and tipping along the waist, cuffs and raglan sleeves. The logo on the chest is an archival style known as the “golf tee and circle.” The FOOTJOY logo on the sleeve is screen printed.",
  "-785b81de": "DETAILS",
  "15170a48": "FOOTJOY X TODD SNYDER THE KNIT PIQUE POLO IN BLUE",
  "-24f8195": "How would golf’s most iconic players from the Sixties and Seventies dress if they stepped onto the links today? The answer is this new collection of polos, windbreakers, hoodies, cardigans, shorts, joggers, caps, and golf shoes. Inspired by the tipped polos that were popular in the 1960s, these are made from the performance fabric ProDry Pique. The look is retro, the anti-wicking/anti-microbial technology is state-of-the-art.  The hand feel is soft and a little bit silky. Design details include tipping on the sleeves, collar, pocket and placket. This is a great polo for on the course, at the 19th Hole and beyond.",
  "61c7d18a": "FOOTJOY X TODD SNYDER THE PACKARD GOLF SHOE",
  "64a449dd": "Todd has designed this limited-edition version of FootJoy’s Packard style as a white leather saddle shoe with a blue camo pattern for the saddle. The hit of camo is framed in gray. The blue color story also turns up in the laces, liner and heel tape with a subtle Todd Snyder logo. As our friends at Footjoy like to say of The Packard, it is “inspired by then, supercharged for now.” Utilizing advanced lightweight materials and the proprietary VersaTrax+ traction technology, the Premiere Series delivers incredible underfoot comfort, game-changing traction, and Tour-caliber performance.",
  "334f8414": "FOOTJOY X TODD SNYDER THE SEERSUCKER GLEN PLAID MADISON SHORT",
  "-6b1f6e60": "How would golf’s most iconic players from the Sixties and Seventies dress if they stepped onto the links today? The answer is this new collection of polos, windbreakers, hoodies, cardigans, shorts, joggers, caps, and golf shoes. A case in point: Our popular Madison Short combines the polish of a dress short with the relaxed vibe of a pull on. The short has an elastic waistband and a drawcord waist.  The Glen Plaid pattern adds a sartorial touch to an otherwise casual look, and the seersucker fabric is almost all cotton with just a hint of stretch.  Perfect for those days you’re trying to sneak in 9 holes before or after working from home.",
  "34109a55": "Patreon",
  "-20e9cf80": "Dribbble",
  "280d3723": "YouTube",
  "792b2792": "Instagram",
  "7a76443d": "Use with CMS or plain divs",
  "6bd5ac9d": "Carousel Slider Collection",
  "8b86fcf": "Watch Tutorial",
  "4ab8aeaa": "arrows & pagination",
  "-7aba473": "Style Guide"
}